Importing pandas library

In [4]:
import pandas as pd
import numpy as np

Series in pandas

In [5]:
s = pd.Series([10,20,30,40])
print(s)

0    10
1    20
2    30
3    40
dtype: int64

Custom indexing

In [6]:
s= pd.Series([10,20,30], index=["a","b","c"])
print(s)

a    10
b    20
c    30
dtype: int64

In [7]:
print(s["a"])

10

Series from Dictionary

In [ ]:
data= {"Math":90, "Physics":85, "Chemistry":80}
marks = pd.Series(data) 
#to create a Series from a dictionary, where the keys of the dictionary become the index of the Series and the values become the data of the Series.
print(marks)

Math         90
Physics      85
Chemistry    80
dtype: int64

Data Frames

In [9]:
Data= {"Name": ["Jimmy","Karan","Krish"],
       "Age":[14,18,15],
       "Marks":[87,85,90]}
print(Data)

{'Name': ['Jimmy', 'Karan', 'Krish'], 'Age': [14, 18, 15], 'Marks': [87, 85, 90]}

In [10]:
type(Data)

dict

In [11]:
marks = pd.DataFrame(Data)
print(marks) #Pandas automatically adds a default index.

    Name  Age  Marks
0  Jimmy   14     87
1  Karan   18     85
2  Krish   15     90

In [12]:
# we can also add custom index in pandas dataframe
marks = pd.DataFrame(Data,index=["Student1","Student2","Student3"])
print(marks)

           Name  Age  Marks
Student1  Jimmy   14     87
Student2  Karan   18     85
Student3  Krish   15     90

In [13]:
marks.set_index("Name",inplace= True)
print(marks)

       Age  Marks
Name
Jimmy   14     87
Karan   18     85
Krish   15     90

In [14]:
df= pd.DataFrame({"Name":["Aman","saurav","Karan"],"Age":[22,23,21],"Marks":[85,90,88]})
print(df)

     Name  Age  Marks
0    Aman   22     85
1  saurav   23     90
2   Karan   21     88

In [ ]:
df.head() #
#to display the first few rows of the dataframe, by default it shows the first 5 rows. 
# But you can specify the number of rows to display by passing an argument to the head() method.
# For example, df.head(3) will display the first 3 rows of the dataframe.

     Name  Age  Marks
0    Aman   22     85
1  saurav   23     90
2   Karan   21     88

In [ ]:
df.tail()
#to display the last few rows of the dataframe, by default it shows the last 5 rows.
# You can also specify the number of rows to display by passing an argument to the tail() method.
# For example, df.tail(2) will display the last 2 rows of the dataframe

     Name  Age  Marks
0    Aman   22     85
1  saurav   23     90
2   Karan   21     88

In [17]:
df= pd.DataFrame({"Name":["Aman","saurav","Karan","shubham","Oscar"],"Age":[22,23,21,26,27],"Marks":[85,90,88,98,76]})
print(df)

      Name  Age  Marks
0     Aman   22     85
1   saurav   23     90
2    Karan   21     88
3  shubham   26     98
4    Oscar   27     76

In [18]:
df.head(2)

     Name  Age  Marks
0    Aman   22     85
1  saurav   23     90

In [19]:
df.tail(2)

      Name  Age  Marks
3  shubham   26     98
4    Oscar   27     76

In [ ]:
df.shape #to get the number of rows and columns in the dataframe

(5, 3)

In [ ]:
df.columns #to get the column names of the dataframe

Index(['Name', 'Age', 'Marks'], dtype='object')

In [ ]:
df.info() #to get information about the dataframe, including the number of non-null values in each column and the data types of each column.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   Marks   5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [ ]:
df.describe() #to get statistical summary of the numerical columns in the dataset

             Age     Marks
count   5.000000   5.00000
mean   23.800000  87.40000
std     2.588436   7.98749
min    21.000000  76.00000
25%    22.000000  85.00000
50%    23.000000  88.00000
75%    26.000000  90.00000
max    27.000000  98.00000

Selecting the Data

In [24]:
df["Name"]

0       Aman
1     saurav
2      Karan
3    shubham
4      Oscar
Name: Name, dtype: object

In [25]:
df[["Name","Marks"]]

      Name  Marks
0     Aman     85
1   saurav     90
2    Karan     88
3  shubham     98
4    Oscar     76

Filtering on pandas

In [26]:
df[df["Marks"]>85]

      Name  Age  Marks
1   saurav   23     90
2    Karan   21     88
3  shubham   26     98

In [27]:
df[(df["Age"]>21)&(df["Marks"]>85)]

      Name  Age  Marks
1   saurav   23     90
3  shubham   26     98

In [28]:
df.sort_values("Marks",ascending=False)

      Name  Age  Marks
3  shubham   26     98
1   saurav   23     90
2    Karan   21     88
0     Aman   22     85
4    Oscar   27     76

In [ ]:
df["Age"].value_counts() #to count the number of occurrences of each unique value in the "Age" column

Age
22    1
23    1
21    1
26    1
27    1
Name: count, dtype: int64

Handling missing values

In [33]:
#updating the dataset with null values
df=pd.DataFrame({
    "Name":["Aman","saurav","Karan","shubham",None,"Oscar"],
    "Age":[22,23,None,22,25,26],
    "Marks":[85,None,88,90,56,None]
    })
df

      Name   Age  Marks
0     Aman  22.0   85.0
1   saurav  23.0    NaN
2    Karan   NaN   88.0
3  shubham  22.0   90.0
4     None  25.0   56.0
5    Oscar  26.0    NaN

In [ ]:
df.isnull() #to check for null values in the dataset

    Name    Age  Marks
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False

In [ ]:
df.isnull().sum() 
#to count the number of null values in each column

Name     1
Age      1
Marks    2
dtype: int64

In [35]:
df.dropna() #to drop rows with null values from the dataset

      Name   Age  Marks
0     Aman  22.0   85.0
3  shubham  22.0   90.0

a